package com.example.quizapp.data

import com.example.quizapp.R

fun getCapitalQuestions(region: String): List<Pair<String, List<String>>> {
    val questions = mapOf(
        "Азия" to listOf(
            Pair("Душанбе", listOf("Таджикистан", "Узбекистан", "Казахстан", "Кыргызстан")),
            Pair("Ташкент", listOf("Узбекистан", "Туркменистан", "Казахстан", "Афганистан")),
            Pair("Астана", listOf("Казахстан", "Россия", "Монголия", "Китай")),
            Pair("Пекин", listOf("Китай", "Япония", "Корея", "Вьетнам")),
            Pair("Токио", listOf("Япония", "Китай", "Корея", "Индонезия")),
            Pair("Дели", listOf("Индия", "Пакистан", "Непал", "Бангладеш")),
            Pair("Анкара", listOf("Турция", "Азербайджан", "Грузия", "Иран")),
            Pair("Эр-Рияд", listOf("Саудовская Аравия", "ОАЭ", "Катар", "Бахрейн")),
            Pair("Сеул", listOf("Корея", "Китай", "Япония", "Монголия")),
            Pair("Джакарта", listOf("Индонезия", "Малайзия", "Филиппины", "Таиланд"))
        ),
        "Европа" to listOf(
            Pair("Берлин", listOf("Германия", "Франция", "Италия", "Испания")),
            Pair("Париж", listOf("Франция", "Германия", "Нидерланды", "Швейцария")),
            Pair("Рим", listOf("Италия", "Испания", "Франция", "Греция")),
            Pair("Мадрид", listOf("Испания", "Франция", "Португалия", "Италия")),
            Pair("Лондон", listOf("Великобритания", "Ирландия", "Швеция", "Дания")),
            Pair("Варшава", listOf("Польша", "Чехия", "Венгрия", "Словакия")),
            Pair("Амстердам", listOf("Нидерланды", "Бельгия", "Германия", "Люксембург")),
            Pair("Вена", listOf("Австрия", "Германия", "Швейцария", "Чехия")),
            Pair("Брюссель", listOf("Бельгия", "Франция", "Нидерланды", "Люксембург")),
            Pair("Афины", listOf("Греция", "Италия", "Турция", "Кипр"))
        ),
        "Африка" to listOf(
            Pair("Каир", listOf("Египет", "Судан", "Алжир", "Марокко")),
            Pair("Претория", listOf("Южная Африка", "Намибия", "Мозамбик", "Ботсвана")),
            Pair("Лагос", listOf("Нигерия", "Гана", "Камерун", "Кения")),
            Pair("Алжир", listOf("Алжир", "Марокко", "Тунис", "Ливия")),
            Pair("Найроби", listOf("Кения", "Танзания", "Сомали", "Эфиопия")),
            Pair("Рабат", listOf("Марокко", "Алжир", "Тунис", "Ливия")),
            Pair("Дар-эс-Салам", listOf("Танзания", "Кения", "Уганда", "Руанда")),
            Pair("Луанда", listOf("Ангола", "Замбия", "Конго", "Габон")),
            Pair("Хартум", listOf("Судан", "Южный Судан", "Чад", "Эфиопия")),
            Pair("Аддис-Абеба", listOf("Эфиопия", "Сомали", "Кения", "Судан"))
        ),
        "Америка" to listOf(
            Pair("Вашингтон", listOf("США", "Канада", "Мексика", "Бразилия")),
            Pair("Оттава", listOf("Канада", "США", "Мексика", "Аргентина")),
            Pair("Мехико", listOf("Мексика", "США", "Канада", "Колумбия")),
            Pair("Бразилиа", listOf("Бразилия", "Аргентина", "Парагвай", "Чили")),
            Pair("Буэнос-Айрес", listOf("Аргентина", "Бразилия", "Чили", "Уругвай")),
            Pair("Сантьяго", listOf("Чили", "Аргентина", "Перу", "Колумбия")),
            Pair("Лима", listOf("Перу", "Чили", "Эквадор", "Боливия")),
            Pair("Богота", listOf("Колумбия", "Венесуэла", "Бразилия", "Эквадор")),
            Pair("Каракас", listOf("Венесуэла", "Гайана", "Бразилия", "Колумбия")),
            Pair("Джорджтаун", listOf("Гайана", "Суринам", "Французская Гвиана", "Венесуэла"))
        ),
        "Все" to listOf(
            Pair("Ташкент", listOf("Узбекистан", "Туркменистан", "Казахстан", "Афганистан")),
            Pair("Берлин", listOf("Германия", "Франция", "Италия", "Испания")),
            Pair("Каир", listOf("Египет", "Судан", "Алжир", "Марокко")),
            Pair("Вашингтон", listOf("США", "Канада", "Мексика", "Бразилия")),
            Pair("Душанбе", listOf("Таджикистан", "Узбекистан", "Казахстан", "Кыргызстан")),
            Pair("Париж", listOf("Франция", "Германия", "Нидерланды", "Швейцария")),
            Pair("Претория", listOf("Южная Африка", "Намибия", "Мозамбик", "Ботсвана")),
            Pair("Оттава", listOf("Канада", "США", "Мексика", "Аргентина")),
            Pair("Токио", listOf("Япония", "Китай", "Корея", "Индонезия")),
            Pair("Бразилиа", listOf("Бразилия", "Аргентина", "Парагвай", "Чили"))
        )
    )

    return questions[region]?.shuffled()?.take(10) ?: emptyList()
}


fun getMoneyQuestions(region: String): List<Pair<String, List<String>>> {
    val questions = mapOf(
        "Азия" to listOf(
            Pair("Сомони", listOf("Таджикистан", "Узбекистан", "Киргизстан", "Катар")),
            Pair("Сум", listOf("Узбекистан", "Туркменистан", "Казахстан", "Кыргызстан")),
            Pair("Тенге", listOf("Казахстан", "Россия", "Монголия", "Китай")),
            Pair("Юань", listOf("Китай", "Япония", "Корея", "Вьетнам")),
            Pair("Иена", listOf("Япония", "Китай", "Корея", "Индонезия")),
            Pair("Рупия", listOf("Индия", "Пакистан", "Непал", "Бангладеш")),
            Pair("Лира", listOf("Турция", "Азербайджан", "Грузия", "Иран")),
            Pair("Риал", listOf("Саудовская Аравия", "ОАЭ", "Катар", "Бахрейн")),
            Pair("Вон", listOf("Корея", "Китай", "Япония", "Монголия")),
            Pair("Рупия", listOf("Индонезия", "Малайзия", "Филиппины", "Таиланд"))
        ),
        "Европа" to listOf(
            Pair("Евро", listOf("Германия", "Франция", "Италия", "Испания")),
            Pair("Фунт стерлингов", listOf("Великобритания", "Ирландия", "Швеция", "Дания")),
            Pair("Крона", listOf("Швеция", "Дания", "Норвегия", "Исландия")),
            Pair("Злотый", listOf("Польша", "Чехия", "Венгрия", "Словакия")),
            Pair("Рубль", listOf("Россия", "Беларусь", "Казахстан", "Узбекистан")),
            Pair("Франк", listOf("Швейцария", "Лихтенштейн", "Австрия", "Германия")),
            Pair("Лира", listOf("Италия", "Турция", "Греция", "Кипр")),
            Pair("Лев", listOf("Болгария", "Греция", "Македония", "Сербия")),
            Pair("Корона", listOf("Исландия", "Дания", "Норвегия", "Швеция"))
            ),
        "Африка" to listOf(
            Pair("Найра", listOf("Нигерия", "Гана", "Камерун", "Кения")),
            Pair("Ранд", listOf("Южная Африка", "Намибия", "Мозамбик", "Ботсвана")),
            Pair("Кеф", listOf("Тунис", "Алжир", "Мавритания", "Ливия")),
            Pair("Франк КФА", listOf("Камерун", "Нигер", "Чад", "Габон")),
            Pair("Шиллинг", listOf("Кения", "Уганда", "Танзания", "Эфиопия")),
            Pair("Квача", listOf("Замбия", "Малави", "Зимбабве", "Мозамбик")),
            Pair("Сиди", listOf("Марокко", "Алжир", "Тунис", "Ливия")),
            Pair("Джанги", listOf("Гвинея", "Сьерра-Леоне", "Либерия", "Кот-д'Ивуар")),
            Pair("Франк", listOf("Буркина-Фасо", "Мали", "Нигер", "Гана")),
            Pair("Гуинея", listOf("Гвинея", "Гвинея-Бисау", "Сьерра-Леоне", "Либерия"))
                ),
        "Америка" to listOf(

            Pair("Доллар США", listOf("США", "Канада", "Мексика", "Гренада")),
            Pair("Канадский доллар", listOf("Канада", "США", "Мексика", "Барбадос")),
            Pair("Песо", listOf("Мексика", "Колумбия", "Гондурас", "Чили")),
            Pair("Реал", listOf("Бразилия", "Аргентина", "Чили", "Перу")),
            Pair("Песо", listOf("Аргентина", "Чили", "Перу", "Уругвай")),
            Pair("Боливиано", listOf("Боливия", "Чили", "Перу", "Парагвай")),
            Pair("Сол", listOf("Перу", "Чили", "Боливия", "Эквадор")),
            Pair("Доллар", listOf("Суринам", "Гайана", "Французская Гвиана", "Венесуэла")),
            Pair("Гайанский доллар", listOf("Гайана", "Суринам", "Венесуэла", "Французская Гвиана")),
            Pair("Колумбийский песо", listOf("Колумбия", "Венесуэла", "Эквадор", "Гренада"))
                ),

        "Все" to listOf(

            Pair("Сомони", listOf("Таджикистан", "Узбекистан", "Киргизстан", "Катар")),
            Pair("Евро", listOf("Германия", "Франция", "Италия", "Испания")),
            Pair("Найра", listOf("Нигерия", "Гана", "Камерун", "Кения")),
            Pair("Доллар США", listOf("США", "Канада", "Мексика", "Гренада")),
            Pair("Сум", listOf("Узбекистан", "Туркменистан", "Казахстан", "Кыргызстан")),
            Pair("Фунт стерлингов", listOf("Великобритания", "Ирландия", "Швеция", "Дания")),
            Pair("Ранд", listOf("Южная Африка", "Намибия", "Мозамбик", "Ботсвана")),
            Pair("Канадский доллар", listOf("Канада", "США", "Мексика", "Барбадос")),
            Pair("Рубль", listOf("Россия", "Беларусь", "Казахстан", "Узбекистан")),
            Pair("Песо", listOf("Мексика", "Колумбия", "Гондурас", "Чили"))
                )

            )
    return questions[region]?.shuffled()?.take(10) ?: emptyList()


}




fun getFlagQuestions(region: String): List<Pair<Int, List<String>>> {
    val questions = mapOf(
        "Азия" to listOf(
            Pair(R.drawable.tajikistan, listOf("Таджикистан", "Узбекистан", "Казахстан", "Китай")),
            Pair(R.drawable.uzbekistan, listOf("Узбекистан", "Туркменистан", "Казахстан", "Афганистан")),
            Pair(R.drawable.kazakhstan, listOf("Казахстан", "Россия", "Монголия", "Китай")),
            Pair(R.drawable.china, listOf("Китай", "Япония", "Корея", "Вьетнам")),
            Pair(R.drawable.japan, listOf("Япония", "Китай", "Корея", "Индонезия")),
            Pair(R.drawable.india, listOf("Индия", "Пакистан", "Непал", "Бангладеш")),
            Pair(R.drawable.turkey, listOf("Турция", "Азербайджан", "Грузия", "Иран")),
            Pair(R.drawable.saudi, listOf("Саудовская Аравия", "ОАЭ", "Катар", "Бахрейн")),
            Pair(R.drawable.korea, listOf("Корея", "Китай", "Япония", "Монголия")),
            Pair(R.drawable.indonesia, listOf("Индонезия", "Малайзия", "Филиппины", "Таиланд"))
        ),
        "Европа" to listOf(
            Pair(R.drawable.germany, listOf("Германия", "Франция", "Италия", "Испания")),
            Pair(R.drawable.france, listOf("Франция", "Германия", "Нидерланды", "Швейцария")),
            Pair(R.drawable.italy, listOf("Италия", "Испания", "Франция", "Греция")),
            Pair(R.drawable.spain, listOf("Испания", "Франция", "Португалия", "Италия")),
            Pair(R.drawable.uk, listOf("Великобритания", "Ирландия", "Швеция", "Дания")),
            Pair(R.drawable.russia, listOf("Польша", "Чехия", "Венгрия", "Словакия")),
            Pair(R.drawable.netherlands, listOf("Нидерланды", "Бельгия", "Германия", "Люксембург")),
            Pair(R.drawable.switzerland, listOf("Австрия", "Германия", "Швейцария", "Чехия")),
            Pair(R.drawable.belgium, listOf("Бельгия", "Франция", "Нидерланды", "Люксембург")),
            Pair(R.drawable.sweden, listOf("Греция", "Италия", "Турция", "Кипр"))
        ),
        "Африка" to listOf(
            Pair(R.drawable.egypt, listOf("Египет", "Судан", "Алжир", "Марокко")),
            Pair(R.drawable.southafrica, listOf("Южная Африка", "Намибия", "Мозамбик", "Ботсвана")),
            Pair(R.drawable.nigeria, listOf("Нигерия", "Гана", "Камерун", "Кения")),
            Pair(R.drawable.algeria, listOf("Алжир", "Марокко", "Тунис", "Ливия")),
            Pair(R.drawable.kenya, listOf("Кения", "Танзания", "Сомали", "Эфиопия")),
            Pair(R.drawable.morocco, listOf("Марокко", "Алжир", "Тунис", "Ливия")),
            Pair(R.drawable.tanzania, listOf("Танзания", "Кения", "Уганда", "Руанда")),
            Pair(R.drawable.angola, listOf("Ангола", "Замбия", "Конго", "Габон")),
            Pair(R.drawable.sudan, listOf("Судан", "Южный Судан", "Чад", "Эфиопия")),
            Pair(R.drawable.ethiopia, listOf("Эфиопия", "Сомали", "Кения", "Судан"))
        ),
        "Америка" to listOf(
            Pair(R.drawable.usa, listOf("США", "Канада", "Мексика", "Бразилия")),
            Pair(R.drawable.canada, listOf("Канада", "США", "Мексика", "Аргентина")),
            Pair(R.drawable.mexico, listOf("Мексика", "США", "Канада", "Колумбия")),
            Pair(R.drawable.brazil, listOf("Бразилия", "Аргентина", "Парагвай", "Чили")),
            Pair(R.drawable.argentina, listOf("Аргентина", "Бразилия", "Чили", "Уругвай")),
            Pair(R.drawable.chile, listOf("Чили", "Аргентина", "Перу", "Колумбия")),
            Pair(R.drawable.peru, listOf("Перу", "Чили", "Эквадор", "Боливия")),
            Pair(R.drawable.colombia, listOf("Колумбия", "Венесуэла", "Бразилия", "Эквадор")),
            Pair(R.drawable.venezuela, listOf("Венесуэла", "Гайана", "Бразилия", "Колумбия")),
            Pair(R.drawable.guyana, listOf("Гайана", "Суринам", "Французская Гвиана", "Венесуэла"))
        ),
        "Все" to listOf(

            Pair(R.drawable.kazakhstan, listOf("Казахстан", "Россия", "Монголия", "Китай")),
            Pair(R.drawable.china, listOf("Китай", "Япония", "Корея", "Вьетнам")),
            Pair(R.drawable.japan, listOf("Япония", "Китай", "Корея", "Индонезия")),
            Pair(R.drawable.india, listOf("Индия", "Пакистан", "Непал", "Бангладеш")),
            Pair(R.drawable.uzbekistan, listOf("Узбекистан", "Туркменистан", "Казахстан", "Афганистан")),
            Pair(R.drawable.turkey, listOf("Турция", "Азербайджан", "Грузия", "Иран")),
            Pair(R.drawable.tajikistan, listOf("Таджикистан", "Узбекистан", "Казахстан", "Китай")),
            Pair(R.drawable.saudi, listOf("Саудовская Аравия", "ОАЭ", "Катар", "Бахрейн")),
            Pair(R.drawable.korea, listOf("Корея", "Китай", "Япония", "Монголия")),
            Pair(R.drawable.indonesia, listOf("Индонезия", "Малайзия", "Филиппины", "Таиланд")),
            Pair(R.drawable.france, listOf("Франция", "Германия", "Нидерланды", "Швейцария")),
            Pair(R.drawable.egypt, listOf("Египет", "Судан", "Алжир", "Марокко")),
            Pair(R.drawable.usa, listOf("США", "Канада", "Мексика", "Бразилия")),
            Pair(R.drawable.canada, listOf("Канада", "США", "Мексика", "Аргентина")),
            Pair(R.drawable.germany, listOf("Германия", "Франция", "Италия", "Испания")),
            Pair(R.drawable.brazil, listOf("Бразилия", "Аргентина", "Парагвай", "Чили"))
        )
    )

    return questions[region]?.shuffled()?.take(10) ?: emptyList()
}

